{
  "navbar": {
    "appTitle": "تي إم آي: نمذجة التهديدات المحسنة",
    "logoutButton": "تسجيل الخروج",
    "diagramsButton": "الرسوم البيانية"
  },
  "footer": {
    "copyright": "© {{currentYear}} تي إم آي: نمذجة التهديدات المحسنة",
    "about": "حول",
    "privacy": "سياسة الخصوصية",
    "tos": "شروط الخدمة"
  },
  "homeWelcomeTitle": "مرحبا بكم في تي إم آي: نمذجة التهديدات المحسنة",
  "homeDescription": "أداة تعاونية لنمذجة التهديدات مصممة لمساعدة الفرق على تحديد وتحليل وتوثيق التهديدات الأمنية في أنظمتهم. إنشاء ومشاركة وتحرير نماذج التهديدات والرسوم البيانية بشكل تعاوني لتحسين أمان التطبيق الخاص بك.",
  "loginButton": "تسجيل الدخول للبدء",
  "tos": {
    "title": "شروط الخدمة",
    "lastUpdatedDate": "2025-04-06",
    "lastUpdated": "آخر تحديث: {{date}}",
    "intro": {
      "part1": "مرحبًا بك في نسختنا من تي إم آي. تحكم شروط الاستخدام هذه (\"الشروط\") وصولك إلى واستخدامك لهذا الموقع الإلكتروني، وهو نسخة من تطبيق ويب مفتوح المصدر متاح من قبل المشغل المدرج في صفحة ",
      "aboutLink": "حول",
      "part2": " هذا الموقع (\"المشغل\")."
    },
    "section1": {
      "title": "1. قبول الشروط",
      "content": "من خلال الوصول إلى هذا الموقع واستخدامه، فإنك تقبل وتوافق على الالتزام بشروط وأحكام هذه الاتفاقية. إذا كنت لا توافق على هذه الشروط، يرجى عدم استخدام هذا الموقع."
    },
    "section2": {
      "title": "2. استخدام الموقع",
      "content": "يتم توفير هذا الموقع كما هو، باستخدام تي إم آي، وهو برنامج مفتوح المصدر مرخص بموجب ترخيص أباتشي 2.0. يمكنك استخدام الموقع للأغراض القانونية فقط. أنت توافق على عدم إساءة استخدام الموقع أو تعطيله أو محاولة الوصول غير المصرح به إلى الموقع أو أنظمته الأساسية."
    },
    "section3": {
      "title": "3. لا ضمان",
      "content": "يتم توفير الموقع \"كما هو\" دون أي ضمانات من أي نوع، صريحة أو ضمنية، بما في ذلك على سبيل المثال لا الحصر الملاءمة لغرض معين أو التوافر أو الدقة. نحن لا نضمن التشغيل دون انقطاع أو خالي من الأخطاء."
    },
    "section4": {
      "title": "4. حدود المسؤولية",
      "content": "إلى أقصى حد يسمح به القانون، لن يكون المشغل مسؤولاً عن أي أضرار مباشرة أو غير مباشرة أو عرضية أو تبعية ناشئة عن استخدامك أو عدم قدرتك على استخدام الموقع."
    },
    "section5": {
      "title": "5. برمجيات مفتوحة المصدر",
      "content": {
        "part1": "يستخدم هذا الموقع برنامج تي إم آي، ويتوفر رمزه المصدري في الرابط المتوفر في صفحة ",
        "aboutLink": "حول",
        "part2": " هذا الموقع. يخضع استخدامك للبرنامج لشروط ترخيصه مفتوح المصدر. نحن لسنا مسؤولين عن البرنامج نفسه، ولكن فقط عن تشغيل هذه النسخة. قد لا يكون مشغل هذا الموقع مرتبطًا بمشروع تي إم آي أو مبتكريه."
      }
    },
    "section6": {
      "title": "6. تغييرات في الشروط",
      "content": "يجوز للمشغل تحديث هذه الشروط في أي وقت. يشكل الاستمرار في استخدام الموقع بعد التغييرات قبولاً للشروط المحدثة."
    },
    "section7": {
      "title": "7. الإنهاء",
      "content": "يحتفظ المشغل بالحق في تعليق أو إنهاء الوصول إلى الموقع وفقًا لتقدير المشغل، دون إشعار، لأي سبب من الأسباب."
    },
    "section8": {
      "title": "8. القانون الحاكم",
      "content": "تخضع هذه الشروط لقوانين الولاية القضائية التي يقع فيها مقر المشغل (في حالة المنظمة) أو يقيم فيها (في حالة الفرد)، بغض النظر عن مبادئ تنازع القوانين."
    },
    "contactInfo": {
      "part1": "إذا كانت لديك أي أسئلة حول هذه الشروط، فلا تتردد في الاتصال بمشغل هذا الموقع عبر معلومات الاتصال الموجودة على صفحة ",
      "aboutLink": "حول",
      "part2": "."
    }
  },
  "privacy": {
    "title": "سياسة الخصوصية",
    "lastUpdatedDate": "2025-04-06",
    "lastUpdated": "آخر تحديث: {{date}}",
    "intro1": {
      "part1": "هذا الموقع هو نسخة من تطبيق ويب مفتوح المصدر (\"تي إم آي\") الذي يتم توفيره بواسطة المشغل المدرج في صفحة ",
      "aboutLink": "حول",
      "part2": " هذا الموقع (\"المشغل\")."
    },
    "intro2": "يلتزم المشغل بحماية خصوصيتك. توضح سياسة الخصوصية هذه كيفية التعامل مع معلوماتك.",
    "dataTitle": "لا جمع للبيانات أو تخزينها",
    "dataContent": "لا يقوم المشغل بجمع أو تخزين أو معالجة أي بيانات شخصية من المستخدمين. لا يتتبع المشغل أنشطتك، ولا يخزن معلوماتك، ولا يشارك أي بيانات عنك مع أطراف ثالثة لأي غرض كان.",
    "complianceTitle": "الامتثال القانوني",
    "complianceContent": "لن يكشف المشغل عن المعلومات إلا إذا كان مطلوبًا منه القيام بذلك بموجب القانون، مثل الاستجابة لأمر حكومي صالح أو استدعاء. في مثل هذه الحالات، سيمتثل المشغل للالتزامات القانونية المعمول بها.",
    "changesTitle": "التغييرات في هذه السياسة",
    "changesContent": "قد يقوم المشغل بتحديث سياسة الخصوصية هذه من وقت لآخر. سيتم نشر أي تغييرات على هذه الصفحة مع تاريخ \"آخر تحديث\" محدث.",
    "contactTitle": "اتصل بنا",
    "contactContent": {
      "part1": "إذا كانت لديك أي أسئلة حول سياسة الخصوصية هذه، فلا تتردد في الاتصال بمشغل هذا الموقع عبر معلومات الاتصال الموجودة على صفحة ",
      "aboutLink": "حول",
      "part2": "."
    }
  },
  "about": {
    "title": "حول تي إم آي",
    "description1": "تي إم آي (نمذجة التهديدات المحسنة) هي منصة تعاونية لإنشاء وإدارة ومشاركة نماذج التهديدات. مهمتنا هي جعل نمذجة تهديدات الأمان سهلة الوصول وفعالة ومتكاملة في دورة حياة تطوير البرمجيات.",
    "description2": "تتميز المنصة بإنشاء مخططات تفاعلية، وتعاون في الوقت الفعلي، وقدرات شاملة لتوثيق التهديدات. تم بناؤها باستخدام تقنيات الويب الحديثة، وتساعد تي إم آي الفرق على تحديد وتحليل وتخفيف التهديدات الأمنية من خلال النمذجة التعاونية.",
    "contacttitle": "المشغل",
    "contactoperator": "المشغل: ",
    "contactoperatordetails": "معلومات الاتصال بالمشغل: ",
    "sourcetitle": "تطبيق تي إم آي",
    "sourceCode": "الكود المصدري: ",
    "bugReport": "الإبلاغ عن خلل: ",
    "sourceCodeUrl": "https://github.com/ericfitz/tmi",
    "bugReportUrl": "https://github.com/ericfitz/tmi/issues",
    "opensourcetitle": "البرمجيات مفتوحة المصدر",
    "opensource": {
      "paragraph1-intro": "تم بناء هذا التطبيق بدعم من مشاريع مفتوحة المصدر استثنائية. نحن ممتنون للمجتمعات وراء ",
      "paragraph1-outro": " لأدواتهم ومواردهم المتميزة التي تضفي الحيوية على واجهتنا ووظائفنا.",
      "paragraph2-intro": "شكر خاص لمشروع ",
      "paragraph2-outro": " مفتوح المصدر لتوفير الإلهام الذي ساعد في تشكيل رؤيتنا ونهجنا لبناء تطبيق آمن وسهل الاستخدام."
    }
  },
  "diagrams": {
    "pageTitle": "مخططاتي",
    "newButton": "مخطط جديد",
    "lastModified": "آخر تعديل: {{date}}",
    "noItemsMessage": "ليس لديك أي مخططات حتى الآن.",
    "createFirstButton": "أنشئ مخططك الأول"
  },
  "editor": {
    "saveButton": "حفظ",
    "backButton": "العودة إلى المخططات",
    "closeButton": "إغلاق",
    "placeholder": "مكان محرر المخطط (المعرف: {{id}})",
    "properties": {
      "title": "الخصائص",
      "help": "ستظهر خصائص العنصر هنا عند تحديد عنصر."
    },
    "toolbar": {
      "title": "شريط الأدوات",
      "items": {
        "delete": "حذف",
        "style": "نمط",
        "grid": "تبديل الشبكة"
      }
    },
    "palette": {
      "title": "لوحة الألوان",
      "items": {
        "process": "عملية",
        "store": "مخزن",
        "actor": "ممثل",
        "flow": "تدفق",
        "flowCancel": "إلغاء التدفق",
        "delete": "حذف",
        "server": "خادم",
        "database": "قاعدة بيانات",
        "user": "مستخدم",
        "connection": "اتصال"
      }
    }
  }
}
