{
  "navbar": {
    "appTitle": "TMI: Threat Modeling Improved",
    "logoutButton": "Logout",
    "diagramsButton": "Diagrams",
    "currentLanguage": "{{language}}",
    "username": "{{username}}",
    "languageName": "{{language}}"
  },
  "footer": {
    "copyright": "© {{currentYear}} Eric Fitzgerald",
    "about": "About",
    "privacy": "Privacy Policy",
    "tos": "Terms of Service"
  },
  "homeWelcomeTitle": "Welcome to TMI: Threat Modeling Improved",
  "homeDescription": "A collaborative threat modeling tool designed to help teams identify, analyze, and document security threats in their systems. Create, share, and collaboratively edit threat models and diagrams to improve your application security.",
  "loginButton": "Login to Start",
  "tos": {
    "title": "Terms of Service",
    "lastUpdatedDate": "2025-04-06",
    "lastUpdated": "Last updated: ",
    "intro": {
      "part1": "Welcome to our instance of TMI. These Terms of Use (\"Terms\") govern your access to and use of this website, which is made available by the operator listed on the ",
      "aboutLink": "About",
      "part2": " page of this web site (\"The Operator\")."
    },
    "section1": {
      "title": "1. Acceptance of Terms",
      "content": "By accessing and using this web site, you accept and agree to be bound by the terms and provisions of this agreement. If you do not agree to these terms, please do not use this web site."
    },
    "section2": {
      "title": "2. Use of the Website",
      "content": "You may use the website for lawful purposes only. You agree not to misuse, disrupt, or attempt to gain unauthorized access to the website or its underlying systems."
    },
    "section3": {
      "title": "3. No Warranty",
      "content": "The website is provided \"as is\" without warranties of any kind, express or implied, including but not limited to fitness for a particular purpose, availability, or accuracy. We do not guarantee uninterrupted or error-free operation."
    },
    "section4": {
      "title": "4. Limitation of Liability",
      "content": "To the fullest extent permitted by law, The Operator shall not be liable for any direct, indirect, incidental, or consequential damages arising from your use of or inability to use the website."
    },
    "section5": {
      "title": "5. Open Source Software",
      "content": {
        "part1": "This website runs the TMI open source software. Its source code is available at the link provided on the ",
        "aboutLink": "About",
        "part2": " page of this web site. Your use of the software is subject to its open-source license terms. We are not responsible for the software itself, only for operating this instance. The operator of this web site may not be affiliated with the TMI project or its creators."
      }
    },
    "section6": {
      "title": "6. Changes to Terms",
      "content": "The Operator may update these Terms at any time. Continued use of the website after changes constitutes acceptance of the updated Terms."
    },
    "section7": {
      "title": "7. Termination",
      "content": "The Operator reserves the right to suspend or terminate access to the website at The Operator's discretion, without notice, for any reason."
    },
    "section8": {
      "title": "8. Governing Law",
      "content": "These Terms are governed by the laws of the jurisdiction in which The Operator is headquartered (in the case of an organization) or resides (in the case of an individual), without regard to conflict of law principles."
    },
    "contactInfo": {
      "part1": "If you have any questions about these Terms, please feel free to contact the operator of this web site via the contact information on the ",
      "aboutLink": "About",
      "part2": " page."
    }
  },
  "privacy": {
    "title": "Privacy Policy",
    "lastUpdatedDate": "2025-04-06",
    "lastUpdated": "Last updated: ",
    "intro1": {
      "part1": "This web site is an instance of an open-source web application (\"TMI\") that is made available by the operator listed on the ",
      "aboutLink": "About",
      "part2": " page of this web site (\"The Operator\")."
    },
    "intro2": "The Operator is committed to protecting your privacy. This Privacy Policy explains how your information is handled.",
    "dataTitle": "No Data Collection or Storage",
    "dataContent": "The Operator does not collect, store, or process any personal data from users. The Operator does not track your activities, store your information, or share any data about you with third parties for any purpose.",
    "complianceTitle": "Legal Compliance",
    "complianceContent": "The Operator will only disclose information if required to do so by law, such as in response to a valid government order or subpoena. In such cases, The Operator will comply with applicable legal obligations.",
    "changesTitle": "Changes to This Policy",
    "changesContent": "The Operator may update this Privacy Policy from time to time. Any changes will be posted on this page with an updated \"Last Updated\" date.",
    "contactTitle": "Contact Us",
    "contactContent": {
      "part1": "If you have any questions about this Privacy Policy, please feel free to contact the operator of this web site via the contact information on the ",
      "aboutLink": "About",
      "part2": " page."
    }
  },
  "about": {
    "title": "About TMI",
    "description1": "TMI (Threat Modeling Improved) is a collaborative platform for creating, managing, and sharing threat models. Our mission is to make security threat modeling accessible, efficient, and integrated into the software development lifecycle.",
    "description2": "The platform features interactive diagram creation with real-time collaboration, and comprehensive threat documentation capabilities. Built with modern web technologies, TMI helps teams identify, analyze, and mitigate security threats through collaborative modeling.",
    "contacttitle": "Operated By",
    "contactoperator": "Operator: ",
    "contactoperatordetails": "Operator Contact: ",
    "sourcetitle": "TMI Application",
    "sourceCode": "Source Code: ",
    "bugReport": "File a Bug: ",
    "sourceCodeUrl": "https://github.com/ericfitz/tmi",
    "bugReportUrl": "https://github.com/ericfitz/tmi/issues",
    "opensourcetitle": "Open Source",
    "opensource": {
      "paragraph1-intro": "This application is built with the support of exceptional open-source projects. We're grateful to the communities behind ",
      "paragraph1-outro": " for their outstanding tools and resources that bring our interface and functionality to life.",
      "paragraph2-intro": "A special thanks goes to the ",
      "paragraph2-outro": " open-source project for providing inspiration that helped shape our vision and approach to building a secure and user-friendly application."
    }
  },
  "diagrams": {
    "pageTitle": "My Diagrams",
    "newButton": "New Diagram",
    "lastModified": "Last modified: {{date}}",
    "noItemsMessage": "You don't have any diagrams yet.",
    "createFirstButton": "Create your first diagram",
    "diagramTitle": "{{name}}"
  },
  "editor": {
    "saveButton": "Save",
    "backButton": "Back to Diagrams",
    "closeButton": "Close",
    "placeholder": "Diagram editor placeholder (ID: {{id}})",
    "diagramTitle": "{{title}}",
    "header": {
      "newDiagram": "New Diagram",
      "save": "Save",
      "undo": "Undo",
      "redo": "Redo",
      "export": "Export",
      "exportJson": "Export as JSON",
      "exportPng": "Export as PNG",
      "exportSvg": "Export as SVG",
      "import": "Import",
      "theme": "Theme"
    },
    "properties": {
      "title": "Properties",
      "help": "Element properties will appear here when an element is selected."
    },
    "toolbar": {
      "title": "Toolbar",
      "items": {
        "delete": "Delete",
        "style": "Style",
        "grid": "Toggle Grid"
      }
    },
    "palette": {
      "title": "Palette",
      "items": {
        "process": "Process",
        "store": "Store",
        "actor": "Actor",
        "flow": "Flow",
        "flowCancel": "Cancel Flow",
        "delete": "Delete",
        "server": "Server",
        "database": "Database",
        "user": "User",
        "connection": "Connection"
      }
    },
    "states": {
      "uninitialized": "INIT",
      "initializing": "INITIALIZING",
      "loading": "LOADING",
      "stabilizing": "STABILIZING",
      "ready": "READY",
      "editing_label": "EDITING",
      "creating_edge": "CONNECTING",
      "deleting": "DELETING",
      "saving": "SAVING",
      "error": "ERROR",
      "recovering": "RECOVERING"
    }
  }
}
