{
  "navbar": {
    "appTitle": "TMI: การสร้างแบบจำลองภัยคุกคามที่ปรับปรุง",
    "logoutButton": "ออกจากระบบ",
    "diagramsButton": "แผนภาพ",
    "currentLanguage": "{{language}}",
    "username": "{{username}}",
    "languageName": "{{language}}"
  },
  "footer": {
    "copyright": "© {{currentYear}} Eric Fitzgerald",
    "about": "เกี่ยวกับ",
    "privacy": "นโยบายความเป็นส่วนตัว",
    "tos": "เงื่อนไขการให้บริการ"
  },
  "homeWelcomeTitle": "ยินดีต้อนรับสู่ TMI: การสร้างแบบจำลองภัยคุกคามที่ปรับปรุง",
  "homeDescription": "เครื่องมือสร้างแบบจำลองภัยคุกคามแบบการทำงานร่วมกันที่ออกแบบมาเพื่อช่วยทีมในการระบุ วิเคราะห์ และจัดทำเอกสารภัยคุกคามด้านความปลอดภัยในระบบของพวกเขา สร้าง แบ่งปัน และแก้ไขแบบจำลองภัยคุกคามและแผนภาพร่วมกันเพื่อปรับปรุงความปลอดภัยของแอปพลิเคชันของคุณ",
  "loginButton": "เข้าสู่ระบบเพื่อเริ่มต้น",
  "tos": {
    "title": "เงื่อนไขการให้บริการ",
    "lastUpdatedDate": "2025-04-06",
    "lastUpdated": "อัปเดตล่าสุด: ",
    "intro": {
      "part1": "ยินดีต้อนรับสู่อินสแตนซ์ TMI ของเรา เงื่อนไขการใช้งานเหล่านี้ (\"เงื่อนไข\") ควบคุมการเข้าถึงและการใช้งานเว็บไซต์นี้ ซึ่งได้รับการจัดการโดยผู้ดำเนินการที่ระบุในหน้า ",
      "aboutLink": "เกี่ยวกับ",
      "part2": " ของเว็บไซต์นี้ (\"ผู้ดำเนินการ\")"
    },
    "section1": {
      "title": "1. การยอมรับเงื่อนไข",
      "content": "ด้วยการเข้าถึงและใช้งานเว็บไซต์นี้ คุณยอมรับและตกลงที่จะผูกพันตามข้อกำหนดและบทบัญญัติของข้อตกลงนี้ หากคุณไม่เห็นด้วยกับเงื่อนไขเหล่านี้ โปรดอย่าใช้เว็บไซต์นี้"
    },
    "section2": {
      "title": "2. การใช้งานเว็บไซต์",
      "content": "คุณสามารถใช้เว็บไซต์เพื่อวัตถุประสงค์ที่ถูกกฎหมายเท่านั้น คุณตกลงที่จะไม่ใช้งานในทางที่ผิด ขัดขวาง หรือพยายามเข้าถึงเว็บไซต์หรือระบบพื้นฐานโดยไม่ได้รับอนุญาต"
    },
    "section3": {
      "title": "3. ไม่มีการรับประกัน",
      "content": "เว็บไซต์นี้จัดเตรียมให้ \"ตามสภาพที่เป็นอยู่\" โดยไม่มีการรับประกันใด ๆ ทั้งสิ้น ไม่ว่าจะโดยชัดแจ้งหรือโดยนัย รวมถึงแต่ไม่จำกัดเพียงความเหมาะสมสำหรับวัตถุประสงค์เฉพาะ ความพร้อมใช้งาน หรือความถูกต้อง เราไม่รับประกันการทำงานที่ไม่มีการหยุดชะงักหรือปราศจากข้อผิดพลาด"
    },
    "section4": {
      "title": "4. ข้อจำกัดความรับผิดชอบ",
      "content": "ภายใต้ขอบเขตสูงสุดที่กฎหมายอนุญาต ผู้ดำเนินการจะไม่รับผิดต่อความเสียหายทางตรง ทางอ้อม โดยบังเอิญ หรือที่เป็นผลสืบเนื่องที่เกิดจากการใช้งานหรือไม่สามารถใช้งานเว็บไซต์ของคุณ"
    },
    "section5": {
      "title": "5. ซอฟต์แวร์โอเพนซอร์ส",
      "content": {
        "part1": "เว็บไซต์นี้ใช้ซอฟต์แวร์โอเพนซอร์ส TMI รหัสต้นฉบับของซอฟต์แวร์สามารถเข้าถึงได้ที่ลิงก์ที่ให้ไว้ในหน้า ",
        "aboutLink": "เกี่ยวกับ",
        "part2": " ของเว็บไซต์นี้ การใช้งานซอฟต์แวร์ของคุณอยู่ภายใต้เงื่อนไขการอนุญาตโอเพนซอร์ส เราไม่รับผิดชอบต่อตัวซอฟต์แวร์เอง แต่รับผิดชอบเฉพาะการดำเนินการของอินสแตนซ์นี้ ผู้ดำเนินการของเว็บไซต์นี้อาจไม่เกี่ยวข้องกับโครงการ TMI หรือผู้สร้าง"
      }
    },
    "section6": {
      "title": "6. การเปลี่ยนแปลงเงื่อนไข",
      "content": "ผู้ดำเนินการอาจอัปเดตเงื่อนไขเหล่านี้ได้ตลอดเวลา การใช้งานเว็บไซต์อย่างต่อเนื่องหลังจากการเปลี่ยนแปลงถือเป็นการยอมรับเงื่อนไขที่อัปเดต"
    },
    "section7": {
      "title": "7. การยกเลิก",
      "content": "ผู้ดำเนินการขอสงวนสิทธิ์ในการระงับหรือยกเลิกการเข้าถึงเว็บไซต์ตามดุลยพินิจของผู้ดำเนินการ โดยไม่มีการแจ้งให้ทราบล่วงหน้า ไม่ว่าด้วยเหตุผลใดก็ตาม"
    },
    "section8": {
      "title": "8. กฎหมายที่ใช้บังคับ",
      "content": "เงื่อนไขเหล่านี้อยู่ภายใต้กฎหมายของเขตอำนาจศาลที่ผู้ดำเนินการมีสำนักงานใหญ่ตั้งอยู่ (ในกรณีขององค์กร) หรืออาศัยอยู่ (ในกรณีของบุคคล) โดยไม่คำนึงถึงหลักการขัดแย้งของกฎหมาย"
    },
    "contactInfo": {
      "part1": "หากคุณมีคำถามใด ๆ เกี่ยวกับเงื่อนไขเหล่านี้ โปรดติดต่อผู้ดำเนินการของเว็บไซต์นี้ผ่านข้อมูลติดต่อที่หน้า ",
      "aboutLink": "เกี่ยวกับ",
      "part2": ""
    }
  },
  "privacy": {
    "title": "นโยบายความเป็นส่วนตัว",
    "lastUpdatedDate": "2025-04-06",
    "lastUpdated": "อัปเดตล่าสุด: ",
    "intro1": {
      "part1": "เว็บไซต์นี้เป็นอินสแตนซ์ของเว็บแอปพลิเคชันโอเพนซอร์ส (\"TMI\") ที่จัดเตรียมโดยผู้ดำเนินการที่ระบุในหน้า ",
      "aboutLink": "เกี่ยวกับ",
      "part2": " ของเว็บไซต์นี้ (\"ผู้ดำเนินการ\")"
    },
    "intro2": "ผู้ดำเนินการมุ่งมั่นที่จะปกป้องความเป็นส่วนตัวของคุณ นโยบายความเป็นส่วนตัวนี้อธิบายวิธีการจัดการข้อมูลของคุณ",
    "dataTitle": "ไม่มีการเก็บรวบรวมหรือจัดเก็บข้อมูล",
    "dataContent": "ผู้ดำเนินการไม่เก็บรวบรวม จัดเก็บ หรือประมวลผลข้อมูลส่วนบุคคลใด ๆ จากผู้ใช้ ผู้ดำเนินการไม่ติดตามกิจกรรมของคุณ ไม่จัดเก็บข้อมูลของคุณ หรือแบ่งปันข้อมูลใด ๆ เกี่ยวกับคุณกับบุคคลที่สามไม่ว่าด้วยวัตถุประสงค์ใดก็ตาม",
    "complianceTitle": "การปฏิบัติตามกฎหมาย",
    "complianceContent": "ผู้ดำเนินการจะเปิดเผยข้อมูลเฉพาะเมื่อจำเป็นต้องปฏิบัติตามกฎหมายเท่านั้น เช่น การตอบสนองต่อคำสั่งหรือหมายเรียกของรัฐบาลที่ถูกต้อง ในกรณีดังกล่าว ผู้ดำเนินการจะปฏิบัติตามข้อผูกพันทางกฎหมายที่เกี่ยวข้อง",
    "changesTitle": "การเปลี่ยนแปลงนโยบายนี้",
    "changesContent": "ผู้ดำเนินการอาจอัปเดตนโยบายความเป็นส่วนตัวนี้เป็นครั้งคราว การเปลี่ยนแปลงใด ๆ จะถูกโพสต์บนหน้านี้พร้อมกับวันที่ \"อัปเดตล่าสุด\" ที่อัปเดต",
    "contactTitle": "ติดต่อเรา",
    "contactContent": {
      "part1": "หากคุณมีคำถามใด ๆ เกี่ยวกับนโยบายความเป็นส่วนตัวนี้ โปรดติดต่อผู้ดำเนินการของเว็บไซต์นี้ผ่านข้อมูลติดต่อที่หน้า ",
      "aboutLink": "เกี่ยวกับ",
      "part2": ""
    }
  },
  "about": {
    "title": "เกี่ยวกับ TMI",
    "description1": "TMI (การสร้างแบบจำลองภัยคุกคามที่ปรับปรุง) เป็นแพลตฟอร์มการทำงานร่วมกันสำหรับการสร้าง จัดการ และแบ่งปันแบบจำลองภัยคุกคาม ภารกิจของเราคือการทำให้การสร้างแบบจำลองภัยคุกคามด้านความปลอดภัยเข้าถึงได้ง่าย มีประสิทธิภาพ และบูรณาการเข้ากับวงจรการพัฒนาซอฟต์แวร์",
    "description2": "แพลตฟอร์มนี้มีคุณสมบัติการสร้างแผนภาพแบบโต้ตอบ การทำงานร่วมกันแบบเรียลไทม์ และความสามารถในการจัดทำเอกสารภัยคุกคามอย่างครอบคลุม สร้างขึ้นด้วยเทคโนโลยีเว็บสมัยใหม่ TMI ช่วยให้ทีมสามารถระบุ วิเคราะห์ และลดการคุกคามด้านความปลอดภัยผ่านการสร้างแบบจำลองร่วมกัน",
    "contacttitle": "ดำเนินการโดย",
    "contactoperator": "ผู้ดำเนินการ: ",
    "contactoperatordetails": "ติดต่อผู้ดำเนินการ: ",
    "sourcetitle": "แอปพลิเคชัน TMI",
    "sourceCode": "รหัสต้นฉบับ: ",
    "bugReport": "รายงานบัก: ",
    "sourceCodeUrl": "https://github.com/ericfitz/tmi",
    "bugReportUrl": "https://github.com/ericfitz/tmi/issues",
    "opensourcetitle": "โอเพนซอร์ส",
    "opensource": {
      "paragraph1-intro": "แอปพลิเคชันนี้สร้างขึ้นด้วยการสนับสนุนจากโครงการโอเพนซอร์สที่โดดเด่น เรามีความขอบคุณต่อชุมชนเบื้องหลัง ",
      "paragraph1-outro": " สำหรับเครื่องมือและทรัพยากรที่ยอดเยี่ยมที่ทำให้อินเทอร์เฟซและฟังก์ชันของเรามีชีวิตชีวา",
      "paragraph2-intro": "ขอขอบคุณเป็นพิเศษสำหรับโครงการ ",
      "paragraph2-outro": " โอเพนซอร์สสำหรับการให้แรงบันดาลใจที่ช่วยกำหนดวิสัยทัศน์และแนวทางของเราในการสร้างแอปพลิเคชันที่ปลอดภัยและเป็นมิตรกับผู้ใช้"
    }
  },
  "diagrams": {
    "pageTitle": "แผนภาพของฉัน",
    "newButton": "แผนภาพใหม่",
    "lastModified": "แก้ไขล่าสุด: {{date}}",
    "noItemsMessage": "คุณยังไม่มีแผนภาพใด ๆ",
    "createFirstButton": "สร้างแผนภาพแรกของคุณ",
    "diagramTitle": "{{name}}"
  },
  "editor": {
    "saveButton": "บันทึก",
    "backButton": "กลับไปที่แผนภาพ",
    "closeButton": "ปิด",
    "placeholder": "ช่องว่างสำหรับตัวแก้ไขแผนภาพ (ID: {{id}})",
    "integrationNote": "MaxGraph จะถูกรวมที่นี่",
    "diagramTitle": "{{title}}",
    "properties": {
      "title": "คุณสมบัติ",
      "help": "คุณสมบัติของสิ่งประกอบจะปรากฏที่นี่เมื่อเลือกสิ่งประกอบ"
    },
    "toolbar": {
      "title": "แถบเครื่องมือ",
      "items": {
        "delete": "ลบ",
        "style": "รูปแบบ",
        "grid": "สลับตาราง"
      }
    },
    "palette": {
      "title": "จานสี",
      "items": {
        "process": "กระบวนการ",
        "store": "ที่เก็บข้อมูล",
        "actor": "ผู้กระทำ",
        "flow": "การไหล",
        "flowCancel": "ยกเลิกการไหล",
        "delete": "ลบ",
        "server": "เซิร์ฟเวอร์",
        "database": "ฐานข้อมูล",
        "user": "ผู้ใช้",
        "connection": "การเชื่อมต่อ"
      }
    }
  }
}
