Repository: ericfitz/tmi-ux
Catalog: src/locale/messages.*.xlf
Languages: ar, de

# footerCopyright
source: © {{currentYear}} TMI: Threat Modeling Improved
ar: © {{currentYear}} تي إم آي: نمذجة التهديدات المحسنة
de: © {{currentYear}} TMI: Verbesserte Bedrohungsmodellierung

# footerAbout
source: About
ar: حول
de: Über

# footerPrivacy
source: Privacy Policy
ar: سياسة الخصوصية
de: Datenschutzrichtlinie

# footerTos
source: Terms of Service
ar: شروط الخدمة
de: Nutzungsbedingungen

# appTitle
source: TMI: Threat Modeling Improved
ar: تي إم آي: نمذجة التهديدات المحسنة
de: TMI: Verbesserte Bedrohungsmodellierung

# logoutButton
source: Logout
ar: تسجيل الخروج
de: Abmelden

# diagramsButton
source: Diagrams
ar: الرسوم البيانية
de: Diagramme

# homeWelcomeTitle
source: Welcome to TMI: Threat Modeling Improved
ar: مرحبا بكم في تي إم آي: نمذجة التهديدات المحسنة
de: Willkommen bei TMI: Verbesserte Bedrohungsmodellierung

# homeDescription
source: A collaborative threat modeling tool designed to help teams identify, analyze, and document security threats in their systems. Create, share, and collaboratively edit threat models and diagrams to improve your application security.
ar: أداة تعاونية لنمذجة التهديدات مصممة لمساعدة الفرق على تحديد وتحليل وتوثيق التهديدات الأمنية في أنظمتهم. إنشاء ومشاركة وتحرير نماذج التهديدات والرسوم البيانية بشكل تعاوني لتحسين أمان التطبيق الخاص بك.
de: Ein kollaboratives Tool zur Bedrohungsmodellierung, das Teams dabei hilft, Sicherheitsbedrohungen in ihren Systemen zu identifizieren, zu analysieren und zu dokumentieren. Erstellen, teilen und bearbeiten Sie gemeinsam Bedrohungsmodelle und Diagramme, um die Sicherheit Ihrer Anwendung zu verbessern.

# loginButton
source: Login to Start
ar: تسجيل الدخول للبدء
de: Anmelden zum Starten

# tosTitle
source: Terms of Service
ar: شروط الخدمة
de: Nutzungsbedingungen

# tosLastUpdated
source: Last updated: {{'2025-04-06' | date:'longDate'}}
ar: آخر تحديث: {{'2025-04-06' | date:'longDate'}}
de: Zuletzt aktualisiert: {{'2025-04-06' | date:'longDate'}}

# tosIntro
source: Welcome to our instance of TMI. These Terms of Use ("Terms") govern your access to and use of this website, which is an instance of an open-source web application made available by the operator listed on the "About" page of this web site ("The Operator").
ar: مرحبًا بك في نسختنا من تي إم آي. تحكم شروط الاستخدام هذه ("الشروط") وصولك إلى واستخدامك لهذا الموقع الإلكتروني، وهو نسخة من تطبيق ويب مفتوح المصدر متاح من قبل المشغل المدرج في صفحة "حول" هذا الموقع ("المشغل").
de: Willkommen bei unserer Instanz von TMI. Diese Nutzungsbedingungen ("Bedingungen") regeln Ihren Zugriff auf und die Nutzung dieser Website, die eine Instanz einer Open-Source-Webanwendung ist, die vom auf der "Über"-Seite dieser Website aufgeführten Betreiber ("Der Betreiber") zur Verfügung gestellt wird.

# tosSection1Title
source: 1. Acceptance of Terms
ar: 1. قبول الشروط
de: 1. Annahme der Bedingungen

# tosSection1Content
source: By accessing and using this web site, you accept and agree to be bound by the terms and provisions of this agreement. If you do not agree to these terms, please do not use this web site.
ar: من خلال الوصول إلى هذا الموقع واستخدامه، فإنك تقبل وتوافق على الالتزام بشروط وأحكام هذه الاتفاقية. إذا كنت لا توافق على هذه الشروط، يرجى عدم استخدام هذا الموقع.
de: Durch den Zugriff auf und die Nutzung dieser Website akzeptieren Sie die Bedingungen und Bestimmungen dieser Vereinbarung und erklären sich damit einverstanden. Wenn Sie mit diesen Bedingungen nicht einverstanden sind, nutzen Sie diese Website bitte nicht.

# tosSection2Title
source: 2. Use of the Website
ar: 2. استخدام الموقع
de: 2. Nutzung der Website

# tosSection2Content
source: This website is provided as-is, leveraging TMI, an open-source software licensed under the Apache 2.0 License. You may use the website for lawful purposes only. You agree not to misuse, disrupt, or attempt to gain unauthorized access to the website or its underlying systems.
ar: يتم توفير هذا الموقع كما هو، باستخدام تي إم آي، وهو برنامج مفتوح المصدر مرخص بموجب ترخيص أباتشي 2.0. يمكنك استخدام الموقع للأغراض القانونية فقط. أنت توافق على عدم إساءة استخدام الموقع أو تعطيله أو محاولة الوصول غير المصرح به إلى الموقع أو أنظمته الأساسية.
de: Diese Website wird im Ist-Zustand bereitgestellt und verwendet TMI, eine Open-Source-Software, die unter der Apache 2.0-Lizenz lizenziert ist. Sie dürfen die Website nur für rechtmäßige Zwecke nutzen. Sie verpflichten sich, die Website oder ihre zugrunde liegenden Systeme nicht zu missbrauchen, zu stören oder zu versuchen, unbefugten Zugriff darauf zu erlangen.

# tosSection3Title
source: 3. No Warranty
ar: 3. لا ضمان
de: 3. Keine Garantie

# tosSection3Content
source: The website is provided "as is" without warranties of any kind, express or implied, including but not limited to fitness for a particular purpose, availability, or accuracy. We do not guarantee uninterrupted or error-free operation.
ar: يتم توفير الموقع "كما هو" دون أي ضمانات من أي نوع، صريحة أو ضمنية، بما في ذلك على سبيل المثال لا الحصر الملاءمة لغرض معين أو التوافر أو الدقة. نحن لا نضمن التشغيل دون انقطاع أو خالي من الأخطاء.
de: Die Website wird "wie sie ist" ohne jegliche Garantien, ausdrücklich oder implizit, einschließlich, aber nicht beschränkt auf Eignung für einen bestimmten Zweck, Verfügbarkeit oder Genauigkeit bereitgestellt. Wir garantieren keinen unterbrechungsfreien oder fehlerfreien Betrieb.

# tosSection4Title
source: 4. Limitation of Liability
ar: 4. حدود المسؤولية
de: 4. Haftungsbeschränkung

# tosSection4Content
source: To the fullest extent permitted by law, The Operator shall not be liable for any direct, indirect, incidental, or consequential damages arising from your use of or inability to use the website.
ar: إلى أقصى حد يسمح به القانون، لن يكون المشغل مسؤولاً عن أي أضرار مباشرة أو غير مباشرة أو عرضية أو تبعية ناشئة عن استخدامك أو عدم قدرتك على استخدام الموقع.
de: Im maximal gesetzlich zulässigen Umfang haftet der Betreiber nicht für direkte, indirekte, zufällige oder Folgeschäden, die aus Ihrer Nutzung oder Unmöglichkeit der Nutzung der Website entstehen.

# tosSection5Title
source: 5. Open Source Software
ar: 5. برمجيات مفتوحة المصدر

# tosSection5Content
source: This website runs the TMI software, and its source code is available at the link provided on the "About" page of this web site. Your use of the software is subject to its open-source license terms. We are not responsible for the software itself, only for operating this instance. The operator of this web site may not be affiliated with the TMI project or its creators.
ar: يستخدم هذا الموقع برنامج تي إم آي، ويتوفر رمزه المصدري في الرابط المتوفر في صفحة "حول" هذا الموقع. يخضع استخدامك للبرنامج لشروط ترخيصه مفتوح المصدر. نحن لسنا مسؤولين عن البرنامج نفسه، ولكن فقط عن تشغيل هذه النسخة. قد لا يكون مشغل هذا الموقع مرتبطًا بمشروع تي إم آي أو مبتكريه.
de: Diese Website verwendet die TMI-Software, und ihr Quellcode ist über den auf der "Über"-Seite dieser Website angegebenen Link verfügbar. Ihre Nutzung der Software unterliegt ihren Open-Source-Lizenzbedingungen. Wir sind nicht für die Software selbst verantwortlich, sondern nur für den Betrieb dieser Instanz. Der Betreiber dieser Website ist möglicherweise nicht mit dem TMI-Projekt oder seinen Entwicklern verbunden.

# tosSection6Title
source: 6. Changes to Terms
ar: 6. تغييرات في الشروط
de: 6. Änderungen der Bedingungen

# tosSection6Content
source: The Operator may update these Terms at any time. Continued use of the website after changes constitutes acceptance of the updated Terms.
ar: يجوز للمشغل تحديث هذه الشروط في أي وقت. يشكل الاستمرار في استخدام الموقع بعد التغييرات قبولاً للشروط المحدثة.
de: Der Betreiber kann diese Bedingungen jederzeit aktualisieren. Die fortgesetzte Nutzung der Website nach Änderungen stellt die Annahme der aktualisierten Bedingungen dar.

# tosSection7Title
source: 7. Termination
ar: 7. الإنهاء
de: 7. Kündigung

# tosSection7Content
source: The Operator reserves the right to suspend or terminate access to the website at The Operator's discretion, without notice, for any reason.
ar: يحتفظ المشغل بالحق في تعليق أو إنهاء الوصول إلى الموقع وفقًا لتقدير المشغل، دون إشعار، لأي سبب من الأسباب.
de: Der Betreiber behält sich das Recht vor, den Zugang zur Website nach eigenem Ermessen des Betreibers ohne Vorankündigung und aus beliebigem Grund auszusetzen oder zu beenden.

# tosSection8Title
source: 8. Governing Law
ar: 8. القانون الحاكم
de: 8. Geltendes Recht

# tosSection8Content
source: These Terms are governed by the laws of the jurisdiction in which The Operator is headquartered (in the case of an organization) or resides (in the case of an individual)', without regard to conflict of law principles.
ar: تخضع هذه الشروط لقوانين الولاية القضائية التي يقع فيها مقر المشغل (في حالة المنظمة) أو يقيم فيها (في حالة الفرد)، بغض النظر عن مبادئ تنازع القوانين.
de: Diese Bedingungen unterliegen den Gesetzen der Rechtsordnung, in der der Betreiber seinen Hauptsitz hat (im Falle einer Organisation) oder wohnt (im Falle einer Einzelperson), ungeachtet der Grundsätze des Kollisionsrechts.

# tosContactInfo
source: If you have any questions about these Terms, please feel free to contact the operator of this web site via the contact information on the "About" page.
ar: إذا كانت لديك أي أسئلة حول هذه الشروط، فلا تتردد في الاتصال بمشغل هذا الموقع عبر معلومات الاتصال الموجودة على صفحة "حول".
de: Wenn Sie Fragen zu diesen Bedingungen haben, können Sie sich gerne über die Kontaktinformationen auf der "Über"-Seite an den Betreiber dieser Website wenden.

# privacyTitle
source: Privacy Policy
ar: سياسة الخصوصية
de: Datenschutzrichtlinie

# privacyLastUpdated
source: Last updated: {{'2025-04-06' | date:'longDate'}}
ar: آخر تحديث: {{'2025-04-06' | date:'longDate'}}
de: Zuletzt aktualisiert: {{'2025-04-06' | date:'longDate'}}

# privacyIntro1
source: This web site is an instance of an open-source web application ("TMI") that is made available by the operator listed on the "About" page of this web site ("The Operator").
ar: هذا الموقع هو نسخة من تطبيق ويب مفتوح المصدر ("تي إم آي") الذي يتم توفيره بواسطة المشغل المدرج في صفحة "حول" هذا الموقع ("المشغل").
de: Diese Website ist eine Instanz einer Open-Source-Webanwendung ("TMI"), die vom auf der "Über"-Seite dieser Website aufgeführten Betreiber ("Der Betreiber") zur Verfügung gestellt wird.

# privacyIntro2
source: The Operator is committed to protecting your privacy. This Privacy Policy explains how your information is handled.
ar: يلتزم المشغل بحماية خصوصيتك. توضح سياسة الخصوصية هذه كيفية التعامل مع معلوماتك.
de: Der Betreiber verpflichtet sich zum Schutz Ihrer Privatsphäre. Diese Datenschutzrichtlinie erläutert, wie mit Ihren Informationen umgegangen wird.

# privacyDataTitle
source: No Data Collection or Storage
ar: لا جمع للبيانات أو تخزينها
de: Keine Datenerfassung oder -speicherung

# privacyDataContent
source: The Operator does not collect, store, or process any personal data from users. The Operator does not track your activities, store your information, or share any data about you with third parties for any purpose.
ar: لا يقوم المشغل بجمع أو تخزين أو معالجة أي بيانات شخصية من المستخدمين. لا يتتبع المشغل أنشطتك، ولا يخزن معلوماتك، ولا يشارك أي بيانات عنك مع أطراف ثالثة لأي غرض كان.
de: Der Betreiber sammelt, speichert oder verarbeitet keine personenbezogenen Daten von Benutzern. Der Betreiber verfolgt nicht Ihre Aktivitäten, speichert Ihre Informationen nicht und teilt keine Daten über Sie mit Dritten für irgendeinen Zweck.

# privacyComplianceTitle
source: Legal Compliance
ar: الامتثال القانوني
de: Gesetzliche Konformität

# privacyComplianceContent
source: The Operator will only disclose information if required to do so by law, such as in response to a valid government order or subpoena. In such cases, The Operator will comply with applicable legal obligations.
ar: لن يكشف المشغل عن المعلومات إلا إذا كان مطلوبًا منه القيام بذلك بموجب القانون، مثل الاستجابة لأمر حكومي صالح أو استدعاء. في مثل هذه الحالات، سيمتثل المشغل للالتزامات القانونية المعمول بها.
de: Der Betreiber wird Informationen nur dann offenlegen, wenn er gesetzlich dazu verpflichtet ist, z.B. als Reaktion auf eine gültige behördliche Anordnung oder Vorladung. In solchen Fällen wird der Betreiber die geltenden gesetzlichen Verpflichtungen einhalten.

# privacyChangesTitle
source: Changes to This Policy
ar: التغييرات في هذه السياسة
de: Änderungen an dieser Richtlinie

# privacyChangesContent
source: The Operator may update this Privacy Policy from time to time. Any changes will be posted on this page with an updated "Last Updated" date.
ar: قد يقوم المشغل بتحديث سياسة الخصوصية هذه من وقت لآخر. سيتم نشر أي تغييرات على هذه الصفحة مع تاريخ "آخر تحديث" محدث.
de: Der Betreiber kann diese Datenschutzrichtlinie von Zeit zu Zeit aktualisieren. Alle Änderungen werden auf dieser Seite mit einem aktualisierten "Zuletzt aktualisiert"-Datum veröffentlicht.

# privacyContactTitle
source: Contact Us
ar: اتصل بنا
de: Kontaktiere uns

# privacyContactContent
source: If you have any questions about this Privacy Policy, please feel free to contact the operator of this web site via the contact information on the "About" page.
ar: إذا كانت لديك أي أسئلة حول سياسة الخصوصية هذه، فلا تتردد في الاتصال بمشغل هذا الموقع عبر معلومات الاتصال الموجودة على صفحة "حول".
de: Wenn Sie Fragen zu dieser Datenschutzrichtlinie haben, wenden Sie sich bitte über die Kontaktinformationen auf der "Über"-Seite an den Betreiber dieser Website.

# aboutTitle
source: About TMI
ar: حول تي إم آي
de: Über TMI

# aboutDescription1
source: TMI (Threat Modeling Interface) is a collaborative platform for creating, managing, and sharing threat models. Our mission is to make security threat modeling accessible, efficient, and integrated into the software development lifecycle.
ar: تي إم آي (واجهة نمذجة التهديدات) هي منصة تعاونية لإنشاء وإدارة ومشاركة نماذج التهديدات. مهمتنا هي جعل نمذجة تهديدات الأمان سهلة الوصول وفعالة ومتكاملة في دورة حياة تطوير البرمجيات.
de: TMI (Threat Modeling Interface) ist eine kollaborative Plattform für die Erstellung, Verwaltung und gemeinsame Nutzung von Bedrohungsmodellen. Unsere Mission ist es, die Modellierung von Sicherheitsbedrohungen zugänglich, effizient und in den Software-Entwicklungslebenszyklus integriert zu gestalten.

# aboutDescription2
source: The platform features interactive diagram creation, real-time collaboration, and comprehensive threat documentation capabilities. Built with modern web technologies, TMI helps teams identify, analyze, and mitigate security threats through collaborative modeling.
ar: تتميز المنصة بإنشاء مخططات تفاعلية، وتعاون في الوقت الفعلي، وقدرات شاملة لتوثيق التهديدات. تم بناؤها باستخدام تقنيات الويب الحديثة، وتساعد تي إم آي الفرق على تحديد وتحليل وتخفيف التهديدات الأمنية من خلال النمذجة التعاونية.
de: Die Plattform bietet interaktive Diagrammerstellung, Echtzeit-Zusammenarbeit und umfassende Funktionen zur Dokumentation von Bedrohungen. TMI wurde mit modernen Webtechnologien entwickelt und hilft Teams, Sicherheitsbedrohungen durch kollaborative Modellierung zu identifizieren, zu analysieren und zu mindern.

# diagramsPageTitle
source: My Diagrams
ar: مخططاتي
de: Meine Diagramme

# newDiagramButton
source: New Diagram
ar: مخطط جديد
de: Neues Diagramm

# lastModified
source: Last modified: {{diagram.modifiedAt | date:'short'}}
ar: آخر تعديل: {{diagram.modifiedAt | date:'short'}}
de: Zuletzt geändert: {{diagram.modifiedAt | date:'short'}}

# noDiagramsMessage
source: You don't have any diagrams yet.
ar: ليس لديك أي مخططات حتى الآن.
de: Sie haben noch keine Diagramme.

# createFirstDiagramButton
source: Create your first diagram
ar: أنشئ مخططك الأول
de: Erstellen Sie Ihr erstes Diagramm

# saveButton
source: Save
ar: حفظ
de: Speichern

# backToDiagramsButton
source: Back to Diagrams
ar: العودة إلى المخططات
de: Zurück zu Diagrammen

# placeholderEditorText
source: Diagram editor placeholder (ID: {{diagramId}})
ar: مكان محرر المخطط (المعرف: {{diagramId}})
de: Diagramm-Editor-Platzhalter (ID: {{diagramId}})

# maxGraphIntegrationNote
source: MaxGraph will be integrated here
ar: سيتم دمج MaxGraph هنا
de: MaxGraph wird hier integriert

# propertiesTitle
source: Properties
ar: الخصائص
de: Eigenschaften

# propertiesHelp
source: Element properties will appear here when an element is selected.
ar: ستظهر خصائص العنصر هنا عند تحديد عنصر.
de: Elementeigenschaften werden hier angezeigt, wenn ein Element ausgewählt ist.

# paletteTitle
source: Palette
ar: لوحة الألوان

# paletteItemServer
source: Server
ar: خادم

# paletteItemDatabase
source: Database
ar: قاعدة بيانات
de: Datenbank

# paletteItemUser
source: User
ar: مستخدم
de: Benutzer

# paletteItemConnection
source: Connection
ar: اتصال
de: Verbindung
